import math


def area(r):
    '''
    Принимает радиус окружности r, возвращает значение площади данной окружности.

            Параметры:
                    r (float): вещественное число, обозначающее радиус окружности

            Возвращаемое значение:
                    circle_area (float): вещественное число, обозначающее площадь окружности

            Пример использования:
                    >>> area(3)
                    28.274333882308138
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Принимает длину радиуса окружности r, возвращает значение длины данной окружности.

            Параметры:
                    r (float): вещественное число, обозначающее длину радиуса окружности

            Возвращаемое значение:
                    circle_perimeter (float): вещественное число, обозначающее длину окружности
            
            Пример использования:
                    >>> perimeter(3)
                    18.84955592153876
    '''
    return 2 * math.pi * r
