def area(a, b):
    '''
    Принимает ширину и высоту прямоугольника a и b, возвращает значение площади данного прямоугольника.

            Параметры:
                    a (float): вещественное число, обозначающее ширину прямоугольника
                    b (float): вещественное число, обозначающее высоту прямоугольника

            Возвращаемое значение:
                    rectangle_area (float): вещественное число, обозначающее площадь прямоугольника
            
            Пример использования:
                    >>> area(3, 2)
                    6
    '''
    return a * b


def perimeter(a, b):
    '''
    Принимает ширину и высоту прямоугольника a и b, возвращает значение периметра данного прямоугольника.

            Параметры:
                    a (float): вещественное число, обозначающее ширину прямоугольника
                    b (float): вещественное число, обозначающее высоту прямоугольника

            Возвращаемое значение:
                    rectangle_perimeter (float): вещественное число, обозначающее периметр прямоугольника
            
            Пример использования:
                    >>> perimeter(3, 2)
                    10
    '''
    return 2 * (a + b)
