def area(a):
    '''
    Принимает длину стороны квадрата a, возвращает значение площади данного квадрата.

            Параметры:
                    a (float): вещественное число, обозначающее длину стороны квадрата

            Возвращаемое значение:
                    square_area (float): вещественное число, обозначающее площадь квадрата

            Пример использования:
                    >>> area(5)
                    25
    '''
    return a * a


def perimeter(a):
    '''
    Принимает длину стороны квадрата a, возвращает значение периметра данного квадрата.

            Параметры:
                    a (float): вещественное число, обозначающее длину стороны квадрата

            Возвращаемое значение:
                    square_perimeter (float): вещественное число, обозначающее периметр квадрата
            
            Пример использования:
                    >>> perimeter(5)
                    20
    '''
    return 4 * a
