def area(a, h):
    '''
    Принимает длину основания a и длину высоты h к этому основанию, возвращает значение площади треугольника.

            Параметры:
                    a (float): вещественное число, обозначающее длину основания треугольника
                    h (float): вещественное число, обозначающее длину высоты к основанию треугольника

            Возвращаемое значение:
                    triangle_area (float): вещественное число, обозначающее площадь прямоугольника
            
            Пример использования:
                    >>> area(4, 2)
                    4
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Принимает длины сторон треугольника a, b и c, возвращает значение периметра данного прямоугольника.

            Параметры:
                    a (float): вещественное число, обозначающее длину первой стороны треугольника
                    b (float): вещественное число, обозначающее длину второй стороны треугольника
                    c (float): вещественное число, обозначающее длину третьей стороны треугольника

            Возвращаемое значение:
                    triangle_perimeter (float): вещественное число, обозначающее периметер треугольника
            
            Пример использования:
                    >>> perimeter(3, 4, 5)
                    12
    '''
    return a + b + c
